bobmittmann/thinkos/arch/stm32/libstm32f/otg_hs/stm32f-otg_hs_dev.c
/* 
 * Copyright(C) 2013 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the YARD-ICE.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-otg_hs_dev.c
 * @brief STM32F USB Full Speed Device Driver
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifdef CONFIG_H
#include "config.h"
#endif

#include <sys/stm32f.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <arch/cortex-m3.h>
#include <sys/delay.h>
#include <sys/usb-dev.h>
#include <sys/param.h>

#include <sys/dcclog.h>

#ifndef STM32_ENABLE_OTG_HS 
#define STM32_ENABLE_OTG_HS 0
#endif 

#ifndef STM32_OTG_HS_EP_MAX 
#define STM32_OTG_HS_EP_MAX 4
#endif

#ifndef STM32_OTG_HS_ENABLE_VBUS
#define STM32_OTG_HS_ENABLE_VBUS 1
#endif

#define EP_MAX      STM32_OTG_HS_EP_MAX 
#define ENABLE_VBUS STM32_OTG_HS_ENABLE_VBUS
#define RX_FIFO_SIZE 512

#ifdef STM32F_OTG_HS

#if STM32_ENABLE_OTG_HS

/* Endpoint state */
enum ep_state {
	EP_UNCONFIGURED = 0,
	EP_IDLE,
	EP_STALLED,
	EP_SETUP,
	EP_IN_DATA,
	EP_IN_DATA_LAST,
	EP_WAIT_STATUS_IN,
	EP_WAIT_STATUS_OUT,
	EP_OUT_DATA,
	EP_OUT_DATA_LAST,
};

/* Endpoint control */
struct stm32f_otg_ep {
	uint8_t state;
	uint16_t xfr_max;
	uint16_t xfr_rem;
	uint16_t xfr_buf_len;
	uint8_t * xfr_buf;
	uint8_t * xfr_ptr;
	/* reload value for the DOEPTSIZ register */
	uint32_t doeptsiz;
	/* endpoint callback */
	union {
		usb_class_on_ep_ev_t on_ev;
		usb_class_on_ep_in_t on_in;
		usb_class_on_ep_out_t on_out;
		usb_class_on_ep_setup_t on_setup;
	};
};

/* USB Device runtime driver data */
struct stm32f_otg_drv {
	struct stm32f_otg_hs * otg_hs;
	struct stm32f_otg_ep ep[EP_MAX];
	usb_class_t * cl;
	const struct usb_class_events * ev;
	struct usb_request req;
	uint16_t fifo_addr;
};

/* EP TX fifo memory allocation */
static void __ep_pktbuf_alloc(struct stm32f_otg_drv * drv, 
							  int ep_id, int siz)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;

	switch (ep_id) {
	case 0:
		otg_hs->dieptxf0 = OTG_HS_TX0FD_SET(siz / 4) | 
			OTG_HS_TX0FSA_SET(drv->fifo_addr / 4);
		break;
	case 1:
		otg_hs->dieptxf1 = OTG_HS_INEPTXFD_SET(siz / 4) | 
			OTG_HS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
	case 2:
		otg_hs->dieptxf2 = OTG_HS_INEPTXFD_SET(siz / 4) | 
			OTG_HS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
#if (EP_MAX > 3)
	case 3:
		otg_hs->dieptxf3 = OTG_HS_INEPTXFD_SET(siz / 4) | 
			OTG_HS_INEPTXSA_SET(drv->fifo_addr / 4);
		break;
#endif
	}

	DCC_LOG2(LOG_INFO, "addr=%d siz=%d", drv->fifo_addr, siz);

	drv->fifo_addr += siz;
}

static void __copy_from_pktbuf(void * ptr,
							volatile uint32_t * pop,
							unsigned int cnt)
{
	uint8_t * dst = (uint8_t *)ptr;
	uint32_t data;
	int i;

	/* pop data from the fifo and copy to destination buffer */
	for (i = 0; i < (cnt + 3) / 4; i++) {
		data = *pop;
		*dst++ = data;
		*dst++ = data >> 8;
		*dst++ = data >> 16;
		*dst++ = data >> 24;
	}
}

static bool __ep_tx_push(struct stm32f_otg_drv * drv, int ep_id)
{
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	int cnt;

	/* push data into transmit fifo */
	cnt = stm32f_otg_hs_txf_push(otg_hs, ep_id, ep->xfr_ptr);

	if (cnt < 0) {
		DCC_LOG(LOG_WARNING, "stm32f_otg_hs_txf_push() failed!");
		otg_hs->diepempmsk &= ~(1 << ep_id);
		return false;
	}

	DCC_LOG2(LOG_INFO, "cnt=%d ptr=%p", cnt, ep->xfr_ptr);

	ep->xfr_ptr += cnt;
	ep->xfr_rem -= cnt;

	return true;
}

static void __ep_rx_pop(struct stm32f_otg_drv * drv, int ep_id, int len)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	volatile uint32_t * pop = &otg_hs->dfifo[ep_id].pop;
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];
	uint8_t * dst;
	uint32_t data;
	int wcnt;
	int i;

	/* Number of words in the receive fifo */
	wcnt = (len + 3) / 4;
	DCC_LOG1(LOG_INFO, "poping %d words from FIFO.", wcnt);

	if (ep->xfr_rem >= len) {
		/* If we have enough room in the destination buffer
		 * pop data from the fifo and copy to destination buffer */
		dst = ep->xfr_ptr;
		for (i = 0; i < wcnt; ++i) {
			data = *pop;
			*dst++ = data;
			*dst++ = data >> 8;
			*dst++ = data >> 16;
			*dst++ = data >> 24;
		}
		ep->xfr_ptr += len;
		ep->xfr_rem -= len;
	} else {
		DCC_LOG(LOG_WARNING, "not room to copy the whole packet, discarding!");
		for (i = 0; i < wcnt; ++i) {
			data = *pop;
			(void)data;
		}
	}
}

static void __ep_zlp_send(struct stm32f_otg_hs * otg_hs, int epnum)
{
	DCC_LOG(LOG_INFO, "Send: ZLP");

	otg_hs->inep[epnum].dieptsiz = OTG_HS_PKTCNT_SET(1) | OTG_HS_XFRSIZ_SET(0);
	otg_hs->inep[epnum].diepctl |= OTG_HS_EPENA | OTG_HS_CNAK;
}

/* start sending */
int stm32f_otg_hs_dev_ep_pkt_xmit(struct stm32f_otg_drv * drv, int ep_id,
							   void * buf, unsigned int len)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct stm32f_otg_ep * ep;
	int ret;

	if ((unsigned int)ep_id >= EP_MAX) {
		DCC_LOG(LOG_WARNING, "invalid EP");
		return -1;
	}

	ep = &drv->ep[ep_id];
	ep->xfr_ptr = buf;
	ep->xfr_rem = MIN(len, ep->xfr_max);

	/* prepare fifo to transmit */
	if ((ret = stm32f_otg_hs_txf_setup(otg_hs, ep_id, ep->xfr_rem)) < 0) {
		DCC_LOG(LOG_WARNING, "stm32f_otg_hs_txf_setup() failed!");
	} else {
		/* umask FIFO empty interrupt */
		otg_hs->diepempmsk |= (1 << ep_id);
	}

	DCC_LOG4(LOG_INFO, "ep_id=%d len=%d xfr_max=%d ret=%d", 
			 ep_id, len, ep->xfr_max, ret);

	return ret;
}

int stm32f_otg_hs_dev_ep_pkt_recv(struct stm32f_otg_drv * drv, int ep_id,
							   void * buf, int len)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	uint8_t * cp = (uint8_t *)buf;
	struct stm32f_otg_ep * ep;
	uint32_t data;
	int cnt;
	int rem;

	if ((unsigned int)ep_id >= EP_MAX) {
		DCC_LOG(LOG_WARNING, "invalid EP");
		return -1;
	}

	DCC_LOG2(LOG_INFO, "ep_id=%d len=%d", ep_id, len);

	ep = &drv->ep[ep_id];
	
	/* transfer data from fifo */
	cnt = MIN(ep->xfr_rem, len);

