bobmittmann/thinkos/arch/stm32/libstm32f/otg_hs/stm32f-otg_hs_dev.c
	rem = cnt;
	while (rem >= 4) {
		/* word trasfer */
		data = otg_hs->dfifo[ep_id].pop;
		cp[0] = data;
		cp[1] = data >> 8;
		cp[2] = data >> 16;
		cp[3] = data >> 24;
		cp += 4;
		rem -= 4;
	}

	if (rem > 0) {
		/* remaining data */
		data = otg_hs->dfifo[ep_id].pop;
		cp[0] = data;
		if (rem > 1)
			cp[1] = data >> 8;
		if (rem > 2)
			cp[2] = data >> 16;
		rem = 0;
	}

	if ((rem = ep->xfr_rem - cnt) > 0) {
		DCC_LOG1(LOG_WARNING, "dropping %d bytes...", rem);
		/* remove remaining data from fifo */
		do {
			data = otg_hs->dfifo[ep_id].pop;
			(void)data;
			rem -= 4;
		} while (rem > 0);
	}

	/* reset transfer pointer */
	ep->xfr_rem = 0;

	/* 5. After the data payload is popped from the receive FIFO, the 
	   RXFLVL interrupt (OTG_HS_GINTSTS) must be unmasked. */
	DCC_LOG1(LOG_INFO, "cnt=%d enabling RXFLVL interrupt", cnt);

	/* Reenable RX fifo interrupts */
	otg_hs->gintmsk |= OTG_HS_RXFLVLM;

	return cnt;
}


int stm32f_otg_hs_dev_ep_ctl(struct stm32f_otg_drv * drv, 
						  int ep_id, unsigned int opt)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];

	DCC_LOG2(LOG_INFO, "ep=%d opt=%d", ep_id, opt);

	switch (opt) {
	case USB_EP_RECV_OK:
	case USB_EP_NAK_CLR:
		/* Clear NAK, prepare to receive  ... */
		otg_hs->outep[ep_id].doepctl |= OTG_HS_CNAK;
		break;

	case USB_EP_NAK_SET:
		otg_hs->outep[ep_id].doepctl |= OTG_HS_SNAK;
		break;

	case USB_EP_ZLP_SEND:
		__ep_zlp_send(otg_hs, ep_id);
		break;

	case USB_EP_STALL:
#if 0
		__ep_stall(drv, ep_id);
		ep->state = EP_STALLED;
#endif
		break;

	case USB_EP_DISABLE:
		ep->state = EP_UNCONFIGURED;
		break;
	}

	return 0;
}


int stm32f_otg_hs_dev_ep_init(struct stm32f_otg_drv * drv, 
						   const usb_dev_ep_info_t * info, 
						   void * xfr_buf, int buf_len)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct stm32f_otg_ep * ep;
	int mxpktsz = info->mxpktsz;
	int ep_id;

	if ((ep_id = info->addr & 0x7f) > 3) {
		DCC_LOG1(LOG_ERROR, "invalid address addr=%d", ep_id);
		return -1;
	}

	DCC_LOG3(LOG_INFO, "ep_id=%d addr=%d mxpktsz=%d", 
			 ep_id, info->addr & 0x7f, mxpktsz);

	ep = &drv->ep[ep_id];
	ep->xfr_buf = (uint8_t *)xfr_buf;
	ep->xfr_buf_len = buf_len;
	ep->xfr_ptr = NULL;
	ep->xfr_rem = 0;
	ep->state = EP_IDLE;
	ep->on_ev = info->on_ev;

	/* mask FIFO empty interrupt */
	otg_hs->diepempmsk &= ~(1 << ep_id);

	if (ep_id == 0) {
		ep->xfr_max = mxpktsz;

		/* Initialize EP0 */
		otg_hs->inep[0].diepctl = OTG_HS_TXFNUM_SET(0) |
			OTG_HS_EP0_MPSIZ_SET(mxpktsz);

		/* 3. Set up the Data FIFO RAM for each of the FIFOs
		   - Program the OTG_HS_GRXFSIZ register, to be able to receive
		   control OUT data and setup data. If thresholding is not enabled,
		   at a minimum, this must be equal to 1 max packet size of
		   control endpoint 0 + 2 Words (for the status of the control OUT
		   data packet) + 10 Words (for setup packets).
		   - Program the OTG_HS_TX0FSIZ register (depending on the FIFO number
		   chosen) to be able to transmit control IN data. At a minimum, this
		   must be equal to 1 max packet size of control endpoint 0. */

		__ep_pktbuf_alloc(drv, 0, mxpktsz);

		/*  4. Program the following fields in the endpoint-specific registers
			for control OUT endpoint 0 to receive a SETUP packet
			- STUPCNT = 3 in OTG_HS_DOEPTSIZ0 (to receive up to 3 back-to-back
			SETUP packets)
			At this point, all initialization required to receive SETUP packets
			is done. */

		/* cache this value to be reused */
		ep->doeptsiz = OTG_HS_STUPCNT_SET(3) | 
			OTG_HS_PKTCNT_SET(1) | OTG_HS_XFRSIZ_SET(40);

		/* Prepare to receive */
		otg_hs->outep[0].doeptsiz = ep->doeptsiz;
		/* EP enable */
		otg_hs->outep[0].doepctl |= OTG_HS_EPENA | OTG_HS_CNAK;

		/* Unmask EP0 interrupts */
		otg_hs->daintmsk = OTG_HS_IEPM0 | OTG_HS_OEPM0;

		DCC_LOG2(LOG_INFO, "TX[0]: addr=%04x size=%d",
				 OTG_HS_TX0FSA_GET(otg_hs->dieptxf0) * 4,
				 OTG_HS_TX0FD_GET(otg_hs->dieptxf0) * 4);
	} else {
		uint32_t depctl;

		if (info->addr & USB_ENDPOINT_IN) {
			DCC_LOG(LOG_INFO, "IN ENDPOINT");

			if ((info->attr & 0x03) == ENDPOINT_TYPE_BULK) {
				ep->xfr_max = 6 * mxpktsz;
			} else {
				ep->xfr_max = mxpktsz;
			}

			__ep_pktbuf_alloc(drv, ep_id, ep->xfr_max);
			depctl = otg_hs->inep[ep_id].diepctl;
		} else {
			DCC_LOG(LOG_INFO, "OUT ENDPOINT");
			depctl = otg_hs->outep[ep_id].doepctl;
		}

		depctl &= ~(OTG_HS_MPSIZ_MSK | OTG_HS_EPTYP_MSK | OTG_HS_TXFNUM_MSK);

		depctl |= OTG_HS_MPSIZ_SET(mxpktsz);
		depctl |= OTG_HS_SD0PID | OTG_HS_USBAEP;

		switch (info->attr & 0x03) {
		case ENDPOINT_TYPE_CONTROL:
			DCC_LOG(LOG_INFO, "ENDPOINT_TYPE_CONTROL");
			depctl |= OTG_HS_EPTYP_SET(OTG_HS_EPTYP_CTRL);
			break;

		case ENDPOINT_TYPE_ISOCHRONOUS:
			DCC_LOG(LOG_INFO, "ENDPOINT_TYPE_ISOCHRONOUS");
			depctl |= OTG_HS_EPTYP_SET(OTG_HS_EPTYP_ISOC);
			break;

		case ENDPOINT_TYPE_BULK:
			DCC_LOG(LOG_INFO, "ENDPOINT_TYPE_BULK");
			depctl |= OTG_HS_EPTYP_SET(OTG_HS_EPTYP_BULK);
			break;

		case ENDPOINT_TYPE_INTERRUPT:
			DCC_LOG(LOG_INFO, "ENDPOINT_TYPE_INTERRUPT");
			depctl |= OTG_HS_EPTYP_SET(OTG_HS_EPTYP_INT);
			break;
		}

		if (info->addr & USB_ENDPOINT_IN) {
			/* Activate IN endpoint */
			otg_hs->inep[ep_id].diepctl = depctl | OTG_HS_TXFNUM_SET(ep_id);

			/* Enable endpoint interrupt */
			otg_hs->daintmsk |= OTG_HS_IEPM(ep_id);
		} else {
			uint32_t rxfsiz;
			uint32_t pktcnt;

			/* get the size of the RX fifio */
			rxfsiz = otg_hs->grxfsiz * 4;

			pktcnt = rxfsiz / mxpktsz;

			/* cache this value to be reused */
			ep->doeptsiz = OTG_HS_PKTCNT_SET(pktcnt) |
				OTG_HS_XFRSIZ_SET(pktcnt * mxpktsz);

			/* Prepare EP_OUT to receive */
			otg_hs->outep[ep_id].doeptsiz = ep->doeptsiz;

			/* EP enable */
			/* FIXME: the single input fifo creates a problem as 
			   packets pending on the fifo for one endpoint blocks packets for 
			   other  endpoints. */
			/* XXX: set the nak on endpoint ???? */
			otg_hs->outep[ep_id].doepctl = depctl | OTG_HS_EPENA | OTG_HS_SNAK;

			/* Enable endpoint interrupt */
			otg_hs->daintmsk |= OTG_HS_OEPM(ep_id);
		}

