bobmittmann/thinkos/arch/stm32/libstm32f/otg_hs/stm32f-otg_hs_dev.c
	}

	/* 2. Once the endpoint is activated, the core starts decoding the
	   tokens addressed to that endpoint and sends out a valid
	   handshake for each valid token received for the
	   endpoint. */

	return ep_id;
}

#define OTG_HS_DP   STM32_GPIOB, 15
#define OTG_HS_DM   STM32_GPIOB, 14
#define OTG_HS_ID   STM32_GPIOB, 12

#ifdef STM32_OTG_HS_VBUS 
#define OTG_HS_VBUS STM32_OTG_HS_VBUS
#else
#define OTG_HS_VBUS STM32_GPIOB, 13 
#endif

static inline struct stm32_gpio * vbus_gpio(struct stm32_gpio *__gpio, 
											int __pin) {
	return __gpio;
}

static void otg_io_init(void)
{
	DCC_LOG(LOG_INFO, "Configuring GPIO pins...");

	if (vbus_gpio(OTG_HS_VBUS) == STM32_GPIOA)
		stm32_clk_enable(STM32_RCC, STM32_CLK_GPIOA);

	stm32_clk_enable(STM32_RCC, STM32_CLK_GPIOB);

	stm32_gpio_af(OTG_HS_DP, GPIO_AF12);
	stm32_gpio_af(OTG_HS_DM, GPIO_AF12);
	stm32_gpio_af(OTG_HS_VBUS, GPIO_AF12);
#if 0
	stm32_gpio_af(OTG_HS_ID, GPIO_AF12);
#endif
	stm32_gpio_mode(OTG_HS_DP, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
	stm32_gpio_mode(OTG_HS_DM, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
#ifdef OTG_ENABLE_VBUS
	stm32_gpio_mode(OTG_HS_VBUS, ALT_FUNC, SPEED_LOW);
#else
	stm32_gpio_mode(OTG_HS_VBUS, INPUT, 0);
#endif
#if 0
	stm32_gpio_mode(OTG_HS_ID, ALT_FUNC, PUSH_PULL | SPEED_HIGH);
#endif
}

static void otg_vbus_connect(bool connect)
{
#ifdef OTG_ENABLE_VBUS
	if (connect)
		stm32_gpio_mode(OTG_HS_VBUS, ALT_FUNC, SPEED_HIGH);
	else
		stm32_gpio_mode(OTG_HS_VBUS, INPUT, 0);
#endif
}

void otg_connect(struct stm32f_otg_hs * otg_hs)
{
	/* Connect device */
	otg_hs->dctl &= ~OTG_HS_SDIS;
	udelay(3000);

}

void otg_disconnect(struct stm32f_otg_hs * otg_hs)
{
	otg_hs->dctl |= OTG_HS_SDIS;
	udelay(3000);
}

void otg_power_on(struct stm32f_otg_hs * otg_hs)
{
	DCC_LOG(LOG_INFO, "Enabling USB FS clock...");
	stm32_clk_enable(STM32_RCC, STM32_CLK_OTGHS);

	otg_connect(otg_hs);
	DCC_LOG(LOG_INFO, "[ATTACHED]");
 
	otg_vbus_connect(true);

	/* Enable Cortex interrupt */
	cm3_irq_enable(STM32F_IRQ_OTG_HS);
}

void otg_power_off(struct stm32f_otg_hs * otg_hs)
{
	otg_disconnect(otg_hs);

	otg_vbus_connect(false);

	DCC_LOG(LOG_INFO, "Disabling USB device clock...");
	stm32_clk_disable(STM32_RCC, STM32_CLK_OTGHS);
}

int stm32f_otg_hs_dev_init(struct stm32f_otg_drv * drv, usb_class_t * cl,
		const usb_class_events_t * ev)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;

	drv->cl = cl;
	drv->ev = ev;

	/* Initialize IO pins */
	otg_io_init();

	DCC_LOG(LOG_INFO, "Enabling USB HS clock...");
	stm32_clk_enable(STM32_RCC, STM32_CLK_OTGHS);
	
	DCC_LOG(LOG_TRACE, "Enabling USB HS clock during sleep...");
//	STM32_RCC->ahb1lpenr |= (1 << RCC_OTGHS);

	/* Initialize as a device */
	stm32f_otg_hs_device_init(otg_hs);
//	otg_hs_disconnect(otg_hs);

	/* Reset global interrupts mask */
	otg_hs->gintmsk = OTG_HS_WUIM |
		OTG_HS_SRQIM |
		OTG_HS_DISCINT |
		OTG_HS_CIDSCHGM |
		OTG_HS_FSUSPM |
		OTG_HS_IISOOXFRM |
		OTG_HS_IISOIXFRM |
		OTG_HS_OEPINTM |
		OTG_HS_IEPINTM |
		OTG_HS_EPMISM |
		OTG_HS_EOPFM |
		OTG_HS_ISOODRPM |
		OTG_HS_ENUMDNEM |
		OTG_HS_USBRSTM |
		OTG_HS_USBSUSPM |
		OTG_HS_ESUSPM |
		OTG_HS_GONAKEFFM |
		OTG_HS_GINAKEFFM |
//		OTG_HS_NPTXFEM |
		OTG_HS_RXFLVLM |
		OTG_HS_SOFM |
		OTG_HS_OTGINTM |
		OTG_HS_MMISM;


	
//	otg_hs_connect(otg_hs);
	/* Enable Cortex interrupt */
	cm3_irq_enable(STM32F_IRQ_OTG_HS);

	DCC_LOG(LOG_INFO, "----------------------------------------");

//	mdelay(500);

//	DCC_LOG(LOG_INFO, "........................................");

//	mdelay(500);

	DCC_LOG(LOG_INFO, "Done.");

	return 0;
}

/* 
 *  ---------------------------------------------------------------------------
 * Interrupt handling
 * ---------------------------------------------------------------------------
 */

static void stm32f_otg_hs_dev_ep_out(struct stm32f_otg_drv * drv, 
								  int ep_id, int len)
{
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;

	DCC_LOG1(LOG_INFO, "ep_id=%d", ep_id);

	ep->xfr_rem = len;

	/* FIXME: the single input fifo creates a problem as 
	   packets pending on the fifo for one endpoint blocks packets for 
	   other  endpoints. Ex: an outstanding OUT packet may block a control
	   packet. Either the upper layer garantees the removal or
	   buffering at this layer should be implemented.
	 */
	/* XXX: set the nak on endpoint ???? */
	otg_hs->outep[ep_id].doepctl |= OTG_HS_SNAK;

	/* call class endpoint callback */
	ep->on_out(drv->cl, ep_id, len);
}


static void stm32f_otg_hs_dev_ep_in(struct stm32f_otg_drv * drv, int ep_id)
{
	struct stm32f_otg_ep * ep = &drv->ep[ep_id];

	DCC_LOG1(LOG_INFO, "ep_id=%d", ep_id);

	/* call class endpoint callback */
	ep->on_in(drv->cl, ep_id);
}

static void stm32f_otg_hs_dev_ep0_in(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct stm32f_otg_ep * ep = &drv->ep[0];

	if (ep->state == EP_WAIT_STATUS_IN) {
		struct usb_request * req = &drv->req;
		void * dummy = NULL;
		/* End of SETUP transaction (OUT Data Phase) */	
		ep->on_setup(drv->cl, req, dummy);
		ep->state = EP_IDLE;
		DCC_LOG(LOG_INFO, "EP0 [IDLE]");
		return;
	}


	if (ep->xfr_rem == 0) {
		otg_hs->diepempmsk &= ~(1 << 0);
		/* Prepare to receive */
		otg_hs->outep[0].doeptsiz = ep->doeptsiz;
		/* EP enable */
		otg_hs->outep[0].doepctl |= OTG_HS_EPENA | OTG_HS_CNAK;
		ep->state = EP_IN_DATA;
		DCC_LOG(LOG_INFO, "EP0 [IN_DATA]");
		return;
	} 
	
	if (stm32f_otg_hs_txf_setup(otg_hs, 0, ep->xfr_rem) < 0) {
		DCC_LOG(LOG_ERROR, "stm32f_otg_hs_txf_setup() failed!");
	} else {
		/* umask FIFO empty interrupt */
		otg_hs->diepempmsk |= (1 << 0);
	}
}

static void stm32f_otg_hs_dev_ep0_out(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct stm32f_otg_ep * ep = &drv->ep[0];

	/* last and only transfer */
	if (ep->state == EP_OUT_DATA_LAST) {
		ep->state = EP_WAIT_STATUS_IN;
		DCC_LOG(LOG_INFO, "EP0 [WAIT_STATUS_IN]");
		__ep_zlp_send(otg_hs, 0);
		return;
	}
}

static void stm32f_otg_hs_dev_ep0_setup(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	struct usb_request * req = &drv->req;
	struct stm32f_otg_ep * ep = &drv->ep[0];
	int len;

	DCC_LOG3(LOG_INFO, "type=0x%02x request=0x%02x len=%d ",
			req->type, req->request, req->length);

	/* No-Data control SETUP transaction */
	if (req->length == 0) {
		void * dummy = NULL;

		if (((req->request << 8) | req->type) == STD_SET_ADDRESS) {
			DCC_LOG1(LOG_INFO, "address=%d",  req->value);
			stm32f_otg_hs_addr_set(otg_hs, req->value);
		}
		ep->on_setup(drv->cl, req, dummy);
		ep->state = EP_IDLE;
		__ep_zlp_send(otg_hs, 0);
		return;
	}

	if (req->type & 0x80) {
		/* Control Read SETUP transaction (IN Data Phase) */
		DCC_LOG(LOG_INFO, "EP0 [SETUP] IN Dev->Host");
		ep->xfr_ptr = NULL;
		len = ep->on_setup(drv->cl, req, (void *)&ep->xfr_ptr);
		ep->xfr_rem = MIN(req->length, len);
		DCC_LOG1(LOG_INFO, "EP0 data lenght = %d", ep->xfr_rem);
		/* prepare fifo to transmit */
		if (stm32f_otg_hs_txf_setup(otg_hs, 0, ep->xfr_rem) < 0) {
			DCC_LOG(LOG_WARNING, "stm32f_otg_hs_txf_setup() failed!");
		} else {
			/* umask FIFO empty interrupt */
			otg_hs->diepempmsk |= (1 << 0);
		}
	} else {
		/* Control Write SETUP transaction (OUT Data Phase) */
		ep->xfr_ptr = ep->xfr_buf;
		ep->xfr_rem = req->length;

