bobmittmann/thinkos/arch/stm32/libstm32f/otg_hs/stm32f-otg_hs_dev.c
		DCC_LOG1(LOG_INFO, "xfr_ptr=0x%08x", ep->xfr_ptr);

		if (ep->xfr_rem > ep->xfr_buf_len) {
			ep->xfr_rem = ep->xfr_buf_len;
			DCC_LOG(LOG_ERROR, "transfer to large to fit in the buffer!");
		}

		if (ep->xfr_rem < ep->xfr_max) {
			/* last and only transfer */
			ep->state = EP_OUT_DATA_LAST;
			DCC_LOG(LOG_INFO, "EP0 [OUT_DATA_LAST] OUT Host->Dev!!!!");
		} else {
			ep->state = EP_OUT_DATA;
			DCC_LOG(LOG_INFO, "EP0 [OUT_DATA] OUT Host->Dev!!!!");
		}

		DCC_LOG(LOG_INFO, "Prepare to receive");

		/* Prepare to receive */
		otg_hs->outep[0].doeptsiz = OTG_HS_STUPCNT_SET(0) |
			OTG_HS_PKTCNT_SET(1) | OTG_HS_XFRSIZ_SET(ep->xfr_max);

		/* EP enable */
		otg_hs->outep[0].doepctl |= OTG_HS_EPENA | OTG_HS_CNAK;
	}

}

static void stm32f_otg_hs_dev_reset(struct stm32f_otg_drv * drv)
{
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	uint32_t siz;
	int i;

	DCC_LOG(LOG_MSG, "~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~");

	/* Clear the Remote Wake-up Signaling */
	otg_hs->dctl &= ~OTG_HS_RWUSIG;

	/* Clear all pending interrupts */
	otg_hs->diepmsk = 0;
	otg_hs->doepmsk = 0;
	otg_hs->daint = 0xffffffff;
	otg_hs->daintmsk = 0;
	otg_hs->diepempmsk = 0;
	for (i = 0; i < 4; i++) {
		otg_hs->inep[i].diepint = 0xff;
		otg_hs->outep[i].doepint = 0xff;
		otg_hs->inep[i].dieptsiz = 0;

		drv->ep[i].xfr_rem = 0;
	}

	/* Flush the Tx FIFO */
	stm32f_otg_hs_txfifo_flush(otg_hs, TXFIFO_ALL);
	/* Flush the Rx FIFO */
	stm32f_otg_hs_rxfifo_flush(otg_hs);

	/* Reset global interrupts mask */
	otg_hs->gintmsk = OTG_HS_SRQIM | OTG_HS_OTGINT | OTG_HS_WUIM |
		OTG_HS_USBRSTM | OTG_HS_ENUMDNEM |
		OTG_HS_ESUSPM | OTG_HS_USBSUSPM;

	/* Reset Device Address */
	otg_hs->dcfg &= ~OTG_HS_DAD_MSK;

	/*  Set global IN NAK */
	otg_hs->dctl |= OTG_HS_SGINAK;

	/* Endpoint initialization on USB reset */

	/* 1. Set the NAK bit for all OUT endpoints
	   - SNAK = 1 in OTG_HS_DOEPCTLx (for all OUT endpoints) */
	for (i = 0; i < 4; i++) {
		otg_hs->outep[i].doepctl = OTG_HS_SNAK;
	}

	/* 2. Unmask the following interrupt bits
	   - INEP0 = 1 in OTG_HS_DAINTMSK (control 0 IN endpoint)
	   - OUTEP0 = 1 in OTG_HS_DAINTMSK (control 0 OUT endpoint)
	   - STUP = 1 in DOEPMSK
	   - XFRC = 1 in DOEPMSK
	   - XFRC = 1 in DIEPMSK
	   - TOC = 1 in DIEPMSK */
	otg_hs->doepmsk = OTG_HS_STUPM | OTG_HS_XFRCM | OTG_HS_EPDM;
	otg_hs->diepmsk = OTG_HS_TOM | OTG_HS_EPDM | OTG_HS_XFRCM;

	/* 3. Set up the Data FIFO RAM for each of the FIFOs
	   - Program the OTG_HS_GRXFSIZ register, to be able to receive
	   control OUT data and setup data. If thresholding is not enabled,
	   at a minimum, this must be equal to 1 max packet size of
	   control endpoint 0 + 2 Words (for the status of the control OUT
	   data packet) + 10 Words (for setup packets).
	   - Program the OTG_HS_TX0FSIZ register (depending on the FIFO number
	   chosen) to be able to transmit control IN data. At a minimum, this
	   must be equal to 1 max packet size of control endpoint 0. */

	/* reset fifo memory (packet buffer) allocation pointer */
	drv->fifo_addr = 0;
	/* initialize RX fifo size */
	siz = RX_FIFO_SIZE;
	otg_hs->grxfsiz = siz / 4;
	/* update fifo memory allocation pointer */
	drv->fifo_addr += siz;

	DCC_LOG2(LOG_INFO, "   RX: addr=%04x size=%d",
			 0, otg_hs->grxfsiz * 4);

	drv->ev->on_reset(drv->cl);
}

/* Private USB device driver data */
struct stm32f_otg_drv stm32f_otg_hs_drv0 = {
	.otg_hs = STM32F_OTG_HS
};

void stm32f_otg_hs_isr(void)
{
	struct stm32f_otg_drv * drv = &stm32f_otg_hs_drv0;
	struct stm32f_otg_hs * otg_hs = drv->otg_hs;
	uint32_t gintsts;
	uint32_t ep_intr;

	gintsts = otg_hs->gintsts & otg_hs->gintmsk;

	DCC_LOG1(LOG_JABBER, "GINTSTS=0x%08x", gintsts);

	if (gintsts & OTG_HS_IEPINT) {
		uint32_t diepmsk;
		uint32_t diepint;
		uint32_t diepempmsk;
		uint32_t msk;

		DCC_LOG(LOG_JABBER, "<IEPINT>");

		ep_intr = (otg_hs->daint & otg_hs->daintmsk);
		diepmsk = otg_hs->diepmsk;
		diepempmsk = otg_hs->diepempmsk;

		if (ep_intr & OTG_HS_IEPINT0) {
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 0) & 0x1) << 7;
			diepint = otg_hs->inep[0].diepint & msk;
			/* clear interrupts */
			otg_hs->inep[0].diepint = diepint;
			if (diepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_MSG, "[0] <IEPINT> <XFRC>");
				stm32f_otg_hs_dev_ep0_in(drv);
			} else if (diepint & OTG_HS_TXFE) {
				DCC_LOG(LOG_MSG, "[0] <IEPINT> <TXFE>");
				__ep_tx_push(drv, 0);
			}
		}

		if (ep_intr & OTG_HS_IEPINT1) {
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 1) & 0x1) << 7;
			diepint = otg_hs->inep[1].diepint & msk;
			/* clear interrupts */
			otg_hs->inep[1].diepint = diepint;
			if (diepint & OTG_HS_TXFE) {
				DCC_LOG(LOG_INFO, "[1] <IEPINT> <TXFE>");
				__ep_tx_push(drv, 1);
			}
			if (diepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[1] <IEPINT> <XFRC>");
				stm32f_otg_hs_dev_ep_in(drv, 1);
			}
		}

		if (ep_intr & OTG_HS_IEPINT2) {
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 2) & 0x1) << 7;
			diepint = otg_hs->inep[2].diepint & msk;
			otg_hs->inep[2].diepint = diepint;
			if (diepint & OTG_HS_TXFE) {
				DCC_LOG(LOG_INFO, "[2] <IEPINT> <TXFE>");
				__ep_tx_push(drv, 2);
			}
			if (diepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[2] <IEPINT> <XFRC>");
				stm32f_otg_hs_dev_ep_in(drv, 2);
			}
		}

#if (EP_MAX > 3)
		if (ep_intr & OTG_HS_IEPINT3) {
			/* add the Transmit FIFO empty bit to the mask */
			msk = diepmsk | ((diepempmsk >> 3) & 0x1) << 7;
			diepint = otg_hs->inep[3].diepint & msk;
			otg_hs->inep[3].diepint = diepint;
			if (diepint & OTG_HS_TXFE) {
				DCC_LOG(LOG_INFO, "[3] <IEPINT> <TXFE>");
				__ep_tx_push(drv, 3);
			}
			if (diepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[3] <IEPINT> <XFRC>");
				stm32f_otg_hs_dev_ep_in(drv, 3);
			}
		}
#endif
	}

	if (gintsts & OTG_HS_OEPINT) {
		ep_intr = (otg_hs->daint & otg_hs->daintmsk);

		DCC_LOG(LOG_MSG, "<OEPINT>");

		if (ep_intr & OTG_HS_OEPINT0) {
			uint32_t doepint;

			doepint = otg_hs->outep[0].doepint & otg_hs->doepmsk;

			if (doepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[0] <OEPINT> <OUT XFRC>");
				stm32f_otg_hs_dev_ep0_out(drv);
			}
			if (doepint & OTG_HS_EPDISD) {
				DCC_LOG(LOG_INFO, "[0] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_HS_STUP) {

				DCC_LOG(LOG_INFO, "[0] <OEPINT> <STUP>");
#if 0
				uint32_t doeptsiz;
				int pktcnt;
				int stupcnt;
				int xfrsiz;


				doeptsiz = otg_hs->outep[0].doeptsiz;
				stupcnt = OTG_HS_STUPCNT_GET(doeptsiz);
				(void)stupcnt;
				pktcnt = OTG_HS_PKTCNT_GET(doeptsiz);
				(void)pktcnt;
				xfrsiz = OTG_HS_XFRSIZ_GET(doeptsiz);
				(void)xfrsiz;

				DCC_LOG3(LOG_INFO, "stupcnt=%d pktcnt=%d xfrsiz=%d",
						stupcnt, pktcnt, xfrsiz);
#endif
				stm32f_otg_hs_dev_ep0_setup(drv);
			}
			/* clear interrupts */
			otg_hs->outep[0].doepint = doepint;
		}

		if (ep_intr & OTG_HS_OEPINT1) {
			uint32_t doepint;

			doepint = otg_hs->outep[1].doepint & otg_hs->doepmsk;

			if (doepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <OUT XFRC>");
			}
			if (doepint & OTG_HS_EPDISD) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_HS_STUP) {
				DCC_LOG(LOG_INFO, "[1] <OEPINT> <STUP>");
			}
			/* clear interrupts */
			otg_hs->outep[1].doepint = doepint;
		}

		if (ep_intr & OTG_HS_OEPINT2) {
			uint32_t doepint;

			doepint = otg_hs->outep[2].doepint & otg_hs->doepmsk;

			if (doepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[2] <OEPINT> <OUT XFRC>");
			}
			if (doepint & OTG_HS_EPDISD) {
				DCC_LOG(LOG_INFO, "[2] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_HS_STUP) {
				DCC_LOG(LOG_INFO, "[2] <OEPINT> <STUP>");
			}
			/* clear interrupts */
			otg_hs->outep[2].doepint = doepint;
		}

#if (EP_MAX > 3)
		if (ep_intr & OTG_HS_OEPINT3) {
			uint32_t doepint;

			doepint = otg_hs->outep[3].doepint & otg_hs->doepmsk;

			if (doepint & OTG_HS_XFRC) {
				DCC_LOG(LOG_INFO, "[3] <OEPINT> <OUT XFRC>");
			}
			if (doepint & OTG_HS_EPDISD) {
				DCC_LOG(LOG_INFO, "[3] <OEPINT> <EPDISD>");
			}
			if (doepint & OTG_HS_STUP) {
				DCC_LOG(LOG_INFO, "[3] <OEPINT> <STUP>");
			}

			/* clear interrupts */
			otg_hs->outep[3].doepint = doepint;
		}
#endif
	}

	/* RxFIFO non-empty */
	if (gintsts & OTG_HS_RXFLVL) {
		uint32_t grxsts;
		int epnum;
		int len;
		int stat;

