bobmittmann/thinkos/arch/stm32/libstm32f/otg_hs/stm32f-otg_hs_dev.c
		/* 1. On catching an RXFLVL interrupt (OTG_HS_GINTSTS register),
		   the application must read the Receive status pop
		   register (OTG_HS_GRXSTSP). */
		grxsts = otg_hs->grxstsp;

		epnum = OTG_HS_EPNUM_GET(grxsts);
		len = OTG_HS_BCNT_GET(grxsts);
		(void)len;
		stat = OTG_HS_PKTSTS_GET(grxsts);
		(void)stat;

		DCC_LOG3(LOG_MSG, "[%d] <RXFLVL> len=%d status=%d", epnum, len, stat);

		if (epnum == 0) {

			/* 3. If the received packet’s byte count is not 0, the byte count
			   amount of data is popped from the receive Data FIFO and stored in
			   memory. If the received packet byte count is 0, no data is popped
			   from the receive data FIFO. */
			switch (grxsts & OTG_HS_PKTSTS_MSK) {
			case OTG_HS_PKTSTS_GOUT_NACK:
				/* Global OUT NAK (triggers an interrupt) */
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <GOUT_NACK>", epnum);
				break;
			case OTG_HS_PKTSTS_OUT_DATA_UPDT: {
				/* OUT data packet received */
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <OUT_DATA_UPDT>", epnum);
				__ep_rx_pop(drv, 0, len);
				break;
			}
			case OTG_HS_PKTSTS_OUT_XFER_COMP:
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <OUT_XFER_COMP>", epnum);
				break;
			case OTG_HS_PKTSTS_SETUP_COMP:
				/* SETUP transaction completed (triggers an interrupt) */
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <SETUP_COMP>", epnum);
				break;
			case OTG_HS_PKTSTS_SETUP_UPDT:
				/* SETUP data packet received */
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <SETUP_UPDT>", epnum);

				if (len != 8) {
					DCC_LOG(LOG_ERROR, "setup data len != 8!");
				}

				/* Copy the received setup packet into the setup buffer */
				__copy_from_pktbuf(&drv->req, &otg_hs->dfifo[0].pop, len);

				DCC_LOG3(LOG_MSG, "type=0x%02x request=0x%02x len=%d ",
						drv->req.type, drv->req.request, drv->req.length);

				break;
			}
		} else {
			switch (grxsts & OTG_HS_PKTSTS_MSK) {
			case OTG_HS_PKTSTS_OUT_DATA_UPDT:
				/* OUT data packet received */
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <OUT_DATA_UPDT>", epnum);
				/* 2. The application can mask the RXFLVL interrupt (in
				   OTG_HS_GINTSTS) by writing to RXFLVL = 0 (in
				   OTG_HS_GINTMSK), until it has read the packet from
				   the receive FIFO. */
				otg_hs->gintmsk &= ~OTG_HS_RXFLVLM;
				/* Enable SOF interrupts */
//				otg_hs->gintmsk |=  OTG_HS_SOFM;
//				__ep_rx_pop(drv, 0, len);
				stm32f_otg_hs_dev_ep_out(drv, epnum, len);
				break;
			case OTG_HS_PKTSTS_OUT_XFER_COMP:
				DCC_LOG1(LOG_INFO, "[%d] <RXFLVL> <OUT_XFER_COMP>", epnum);
				DCC_LOG2(LOG_MSG, "[%d] doeptsiz=%08x", epnum, 
						 otg_hs->outep[epnum].doeptsiz);	 
				/* Prepare to receive more */
				otg_hs->outep[epnum].doeptsiz = drv->ep[epnum].doeptsiz;
				/* EP enable */
				/* FIXME: not clearing the NAK here reduces the performance,
				   but we have to garantee tha the class driver
				   periodically remove the packets from 
				   the fifo. Otherwise the EP0 will not receive its
				   packets and we end up with a deadlock situation */
//				otg_hs->outep[epnum].doepctl |= OTG_HS_EPENA | OTG_HS_CNAK;
				/* Disable SOF interrupts */
//				otg_hs->gintmsk &= ~OTG_HS_SOFM;
				break;
			}
		}

		/* 5. After the data payload is popped from the receive FIFO, the
		   RXFLVL interrupt (OTG_HS_GINTSTS) must be unmasked. */
		//	otg_hs->gintmsk |= OTG_HS_RXFLVLM;
	}

	if (gintsts & OTG_HS_SRQINT) {
		/* Session request/new session detected interrupt */
		DCC_LOG(LOG_MSG, "<SRQINT>  [POWERED]");
		otg_hs->gintmsk |= OTG_HS_WUIM | OTG_HS_USBRSTM | OTG_HS_ENUMDNEM |
			OTG_HS_ESUSPM | OTG_HS_USBSUSPM;
	}

	if (gintsts & OTG_HS_OTGINT) {
		uint32_t gotgint = otg_hs->gotgint;
		DCC_LOG(LOG_INFO, "<OTGINT>");
		if (gotgint & OTG_HS_SEDET) {
			DCC_LOG(LOG_INFO, "<SEDET> [ATTACHED]");
			otg_hs->gintmsk = OTG_HS_SRQIM | OTG_HS_OTGINT;
		}
		otg_hs->gotgint = gotgint;
	}

	if (gintsts & OTG_HS_ENUMDNE) {
		uint32_t dsts = otg_hs->dsts;
		(void)dsts;
		
		DCC_LOG3(LOG_INFO, "<ENUMDNE> DSTS={%s%s ENUMSPD=%d }", 
				 (dsts & OTG_HS_EERR) ? " EERR" : "",
				 (dsts & OTG_HS_SUSPSTS) ? " SUSPSTS" : "",
				 OTG_HS_ENUMSPD_GET(dsts));
		/* Unmask global interrupts */
		otg_hs->gintmsk |=  OTG_HS_IEPINTM | OTG_HS_OEPINTM |
			OTG_HS_IISOIXFRM | OTG_HS_IISOOXFRM | OTG_HS_RXFLVLM;
		/*  Clear global IN NAK */
		otg_hs->dctl |= OTG_HS_CGINAK;

	   /* Wait for the ENUMDNE interrupt in OTG_HS_GINTSTS.
	   This interrupt indicates the end of reset on the USB. On receiving this 
	   interrupt, the application must read the OTG_HS_DSTS register to 
	   determine the enumeration speed and perform the steps listed in 
	   Endpoint initialization on enumeration completion on page 1035.
	   At this point, the device is ready to accept SOF packets and perform 
	   control transfers on control endpoint 0. */

	}


	if (gintsts & OTG_HS_USBRST ) {
		/* end of bus reset */
		DCC_LOG(LOG_INFO, "<USBRST> --------------- [DEFAULT]");
		stm32f_otg_hs_dev_reset(drv);
	}

	if (gintsts & OTG_HS_ESUSP) {
		uint32_t dsts = otg_hs->dsts;
		(void)dsts;

		DCC_LOG4(LOG_INFO, "<ESUSP> %s%s ENUMSPD=%d %s", 
				 (dsts & OTG_HS_EERR) ? " EERR" : "",
				 (dsts & OTG_HS_SUSPSTS) ? " SUSPSTS" : "",
				 OTG_HS_ENUMSPD_GET(dsts),
				 otg_hs->pcgcctl & OTG_HS_PHYSUSP ? "PHYSUSP" : "");
	}

#if DEBUG
	if (gintsts & OTG_HS_GONAKEFF) {
		DCC_LOG(LOG_INFO, "<GONAKEFF>");
		otg_hs->gintmsk &= ~OTG_HS_GONAKEFFM;
	}

	if (gintsts & OTG_FS_SOF) {
		DCC_LOG(LOG_MSG, "<SOF>");
	}

	if (gintsts & OTG_HS_PTXFE) {
		DCC_LOG(LOG_INFO, "<PTXFE>");
	}

	if (gintsts & OTG_HS_WKUPINT) {
		DCC_LOG(LOG_INFO, "<WKUPINT>");
		/* disable resume/wakeup interrupts */
	}

	if (gintsts & OTG_HS_USBSUSP) {
		DCC_LOG(LOG_INFO, "<USBSUSP>");
	}

	if (gintsts & OTG_HS_IISOIXFR) {
		DCC_LOG(LOG_INFO, "<IISOIXFR>");
	}

	if (gintsts & OTG_HS_INCOMPISOOUT) {
		DCC_LOG(LOG_INFO, "<INCOMPISOOUT>");
	}

	if (gintsts & OTG_HS_MMIS) {
		DCC_LOG(LOG_INFO, "<MMIS>");
	}

	if (gintsts & OTG_HS_CIDSCHG) {
		DCC_LOG(LOG_INFO, "<CIDSCHG>");
	}

	if (gintsts & OTG_HS_CMOD) {
		DCC_LOG(LOG_INFO, "<CMOD>");
	}
#endif

	/* clear pending interrupts */
	otg_hs->gintsts = gintsts;
}


void stm32f_otg_hs_ep1_out_isr(void)
{
	DCC_LOG(LOG_WARNING, "not implemented!");
}

void stm32f_otg_hs_ep1_in_isr(void)
{
	DCC_LOG(LOG_WARNING, "not implemented!");
}

/* USB device operations */
const struct usb_dev_ops stm32f_otg_hs_ops = {
	.dev_init = (usb_dev_init_t)stm32f_otg_hs_dev_init,
	.ep_init = (usb_dev_ep_init_t)stm32f_otg_hs_dev_ep_init,
	.ep_ctl = (usb_dev_ep_ctl_t)stm32f_otg_hs_dev_ep_ctl,
	.ep_pkt_xmit = (usb_dev_ep_pkt_xmit_t)stm32f_otg_hs_dev_ep_pkt_xmit,
	.ep_pkt_recv = (usb_dev_ep_pkt_recv_t)stm32f_otg_hs_dev_ep_pkt_recv
};

/* USB device driver */
const struct usb_dev stm32f_otg_hs_dev = {
	.priv = (void *)&stm32f_otg_hs_drv0,
	.op = &stm32f_otg_hs_ops
};

#endif /* STM32_ENABLE_OTG_HS */

#endif /* STM32F_OTG_HS */


